In [1]:
# ==============================================================
# ðŸ“˜ Pandas --> Python Basic To Advanced
# Author: Muhammad Shah Asyraf
# Credit: Yash Sharma
# Artificial Intelligence & Machine Learning Course
# ==============================================================

In [2]:
# Pandas Data Science Library
import numpy as np
import pandas as pd
print(pd.__version__)

2.2.3

In [3]:
# numpy array
arr = np.array([10,20,30,40])
print(arr)
print(type(arr))

[10 20 30 40]
<class 'numpy.ndarray'>

In [4]:
# Pandas Series
# A Series is 1D Labeled array

s = pd.Series([10,20,30,40])
print(type(s))
print(s)
print(s.shape)


# In NumPy --> Only Numbers
# In Series --> Numbers + Labels(index)

<class 'pandas.core.series.Series'>
0    10
1    20
2    30
3    40
dtype: int64
(4,)

In [5]:
info = pd.Series(['John' , 28 , 6700 , 'KL'] , index=['name','age','sal','city'])
print(info)
print(info['sal'])
print(info.iloc[2])

# Series is like a Dictionary + array combo

name    John
age       28
sal     6700
city      KL
dtype: object
6700
6700

In [6]:
# values
print(info.values)

['John' 28 6700 'KL']

In [7]:
# Indexing Slicing and Using Loops
s = pd.Series([10,20,30,40,50,60,70] , index=['val1','val2','val3','val4','val5','val6','val7'])
print(s)

val1    10
val2    20
val3    30
val4    40
val5    50
val6    60
val7    70
dtype: int64

In [8]:
# Indexing in Series can be done by using [] or iloc[] or loc[]

print(s.iloc[0])       # for index numbers
print(s.loc['val1'])   # loc used for labels
print(s['val5'])       # [] also used for labels

10
10
50

In [9]:
# Slicing   10 20 30 40 50 60 70 
#           0   1  2  3  4  5  6
#          v1  v2  v3 v4 v5 v6 v7
print(s[1:6]) 

print()
# when slicing by labels , the end label is included
print(s['val2':'val6'])

val2    20
val3    30
val4    40
val5    50
val6    60
dtype: int64

val2    20
val3    30
val4    40
val5    50
val6    60
dtype: int64

In [10]:
# val1 val4 val7
print(s[['val1','val4','val7']])

val1    10
val4    40
val7    70
dtype: int64

In [11]:
# conditional selection
print(s[s% 4 == 0])

val2    20
val4    40
val6    60
dtype: int64

In [12]:
# Using Loops
for i in s:
    print(i)

10
20
30
40
50
60
70

In [13]:
for k,v in s.items():
    print(k,v)

val1 10
val2 20
val3 30
val4 40
val5 50
val6 60
val7 70

In [14]:
for i in enumerate(s):
    print(i)

(0, 10)
(1, 20)
(2, 30)
(3, 40)
(4, 50)
(5, 60)
(6, 70)

In [15]:
# Pandas DataFrame
# it is used to display the information in a tabular fashion
# Pandas DataFrame is 2D Array

data = {'name':['John','Alex','Smith'],
       'dept':['IT','HR','MR'],
       'sal':[6700,5600,3400],
       'city':['KL','JB','ML']
       }
print(data)

{'name': ['John', 'Alex', 'Smith'], 'dept': ['IT', 'HR', 'MR'], 'sal': [6700, 5600, 3400], 'city': ['KL', 'JB', 'ML']}

In [16]:
df = pd.DataFrame(data)
df

    name dept   sal city
0   John   IT  6700   KL
1   Alex   HR  5600   JB
2  Smith   MR  3400   ML

In [17]:
df.shape

(3, 4)

In [18]:
data = {
    'Calories':[420,380,560],
    'Duration':[56,30,75]
}

df = pd.DataFrame(data,index=['Day1','Day2','Day3'])
df

      Calories  Duration
Day1       420        56
Day2       380        30
Day3       560        75

In [19]:
df['Calories']

Day1    420
Day2    380
Day3    560
Name: Calories, dtype: int64

In [20]:
df[['Calories','Duration']]

      Calories  Duration
Day1       420        56
Day2       380        30
Day3       560        75

In [21]:
df.loc['Day2']

Calories    380
Duration     30
Name: Day2, dtype: int64

In [22]:
df.loc[['Day2','Day3']]

      Calories  Duration
Day2       380        30
Day3       560        75

In [23]:
# read_excel() used to Read an excel file
df = pd.read_excel('https://raw.githubusercontent.com/yash240990/Python/master/sampleExcelData.xlsx')
df

,id,first_name,last_name,email,gender,ip_address
0,1,Merle,Draisey,mdraisey0@squarespace.com,Bigender,20.70.199.51
1,2,Casey,Sheach,csheach1@deviantart.com,Male,226.126.229.167
2,3,Darya,Leivers,dleivers2@imgur.com,Female,247.209.88.235
3,4,Fancie,Casebourne,fcasebourne3@g.co,Female,172.34.162.239
4,5,Jenilee,Vsanelli,jvsanelli4@fc2.com,Female,200.104.246.2
...,...,...,...,...,...,...
995,996,Lutero,Yurov,lyurovrn@un.org,Male,95.146.16.187
996,997,Verla,Peery,vpeeryro@com.com,Female,172.90.253.234
997,998,Fran,Langran,flangranrp@ft.com,Male,123.179.99.154
998,999,Gabbi,Cummins,gcumminsrq@jugem.jp,Female,190.13.174.159
999,1000,Gloriane,Marc,gmarcrr@businessweek.com,Female,139.87.192.32

In [24]:
# ExcelFile()
excelfile = pd.ExcelFile('https://raw.githubusercontent.com/yash240990/Python/master/sampleExcelData.xlsx')
excelfile.sheet_names

['data', 'Sheet2']

In [25]:
df = pd.read_excel(excelfile,'Sheet2')
df

   first_name    last_name                                 email
0       Merle      Draisey             mdraisey0@squarespace.com
1       Casey       Sheach               csheach1@deviantart.com
2       Darya      Leivers                   dleivers2@imgur.com
3      Fancie   Casebourne                     fcasebourne3@g.co
4     Jenilee     Vsanelli                    jvsanelli4@fc2.com
5    Charmian    Drinkhall       cdrinkhall5@theglobeandmail.com
6     Janessa       Kivell                 jkivell6@linkedin.com
7       Mirna       Heinsh                  mheinsh7@spotify.com
8       Darby          Lax                   dlax8@people.com.cn
9       Meryl        Riehm                 mriehm9@princeton.edu
10       Anne        Brody                    abrodya@sphinn.com
11       Puff    Langsbury             plangsburyb@canalblog.com
12       Tina      Gregoli                  tgregolic@sfgate.com
13     Barbie       Dahlen                     bdahlend@narod.ru
14     Andeee  Dobrovolski  adobrovolskie@networkadvertising.org
15    Ainsley       Friman                      afrimanf@irs.gov
16        Bil     Shalcros                 bshalcrosg@dion.ne.jp
17    Raimund     Outridge                   routridgeh@lulu.com
18     Whitby     Millward                    wmillwardi@ask.com
19        Rob      Boarder                       rboarderj@51.la
20      Nicky     Curthoys                    ncurthoysk@pbs.org

In [26]:
# read_csv()
# used to read a CSV File
df = pd.read_csv('https://raw.githubusercontent.com/yash240990/Python/master/Position_Salaries.csv')
df

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [27]:
# finding the sum of salary using Pandas
salaries = df['Salary']
print(type(salaries))
total_sal = salaries.sum()
print(total_sal)

<class 'pandas.core.series.Series'>
2495000

In [28]:
# finding the sum of salary using Numpy
salaries = df['Salary'].to_numpy()
print(type(salaries))
total_sal = np.sum(salaries)
print(total_sal)

<class 'numpy.ndarray'>
2495000

In [29]:
# Read a txt file
df = pd.read_csv('https://raw.githubusercontent.com/yashy1626/ds_dataset/refs/heads/main/iris.txt',sep='\t')
df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [30]:
# read_json()
# used to read json file format

df = pd.read_json('https://raw.githubusercontent.com/yash240990/Python/master/simple.json')
df

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78